{
  "backend/main.mo": "Main Motoko actor defining fitness profile and workout plan types, CRUD operations for user profiles, workout/meal plan generation, and access-control-gated query/update methods for a fitness app backend.",
  "feature_evidence.json": "Feature evidence report linking the 'Build My Plan' fix feature to its relevant frontend files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for the project's React components, hooks, pages, and styles.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark theme color tokens (background, foreground, primary, accent, etc.) used throughout the app.",
  "frontend/index.html": "Minimal HTML entry point for the Powerpal Vite/React app, mounting the React root and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that gates content behind Internet Identity auth, shows loading/login/profile-setup screens as needed, and routes between seven named view states using local state.",
  "frontend/src/components/AdaptiveLevelsView.tsx": "Fitness level selector view that lets users pick beginner/intermediate/advanced, saves the updated profile via useSaveCallerUserProfile, and regenerates the workout plan with toast feedback.",
  "frontend/src/components/GoalDrivenPlansView.tsx": "Goal selection view displaying five fitness goal options that saves the updated profile and regenerates both workout and meal plans, with error/success state handling and auto-navigation on completion.",
  "frontend/src/components/LoginScreen.tsx": "Renders the Powerpal login landing page with a mascot, feature highlights, and an Internet Identity login button that shows a loading spinner while authenticating.",
  "frontend/src/components/MealPlanView.tsx": "Displays a weekly meal plan with per-day cards showing breakfast, lunch, dinner, and dessert meals including macro badges; supports regenerating the plan and navigating to other views.",
  "frontend/src/components/OnboardingFlow.tsx": "Multi-step onboarding wizard (personal info → fitness level → goal) that saves the user profile and generates an initial workout plan before calling onComplete.",
  "frontend/src/components/PowerpalMascot.tsx": "Animated mascot component that displays a context-aware rotating speech bubble alongside the Powerpal mascot image, with configurable size and animation.",
  "frontend/src/components/ProfileSetupModal.tsx": "Full-screen three-step profile setup form (personal details, fitness level, goal) that saves the profile and triggers workout plan generation on completion.",
  "frontend/src/components/WeeklyScheduleView.tsx": "Shows the weekly workout schedule as expandable day cards with exercise details, completion toggles, and a refresh button to regenerate the workout plan.",
  "frontend/src/components/WorkoutPlanView.tsx": "React component that displays a user's workout plan, with buttons to generate/regenerate the plan and navigate to meal plan, adaptive levels, weekly schedule, and goal-driven plan views. Includes a header with back/logout actions and uses the PowerpalMascot component.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication, exposing login/logout functions, identity state, and login status via React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profile, workout plan, and meal plan data via the ICP backend actor, including get and generate/save mutations with cache invalidation.",
  "frontend/src/index.css": "Global stylesheet that imports Barlow fonts, configures Tailwind with a dark athletic color theme using OKLCH variables, and defines custom utility classes and keyframe animations for glow effects, cards, and transitions.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider, mounting it to the root DOM element.",
  "frontend/src/pages/HomePage.tsx": "Landing page component showing the Powerpal logo, tagline, mascot, and CTA buttons for onboarding or navigating to workout/meal plans, with a feature grid highlighting key app capabilities.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the Powerpal frontend, defining custom colors (oklch-based), fonts, shadows, border radii, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Project state metadata for Powerpal (version 3), tracking a known issue and an active fix request to repair the 'Build My Plan' workout plan generation feature in WorkoutPlanView/OnboardingFlow."
}