{
  "backend/main.mo": "Motoko actor implementing the Powerpal fitness app backend with profile management, workout/meal plan generation, and role-based access control via MixinAuthorization and AccessControl mixins.",
  "feature_evidence.json": "Feature evidence report confirming that the 'Your Workout Plan' banner background color change to green was implemented in WorkoutPlanView.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of all frontend source files, describing their purpose and key implementation details for the Powerpal fitness app.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH color tokens for light and dark themes used by shadcn-ui components, with no custom app-specific styles.",
  "frontend/index.html": "Minimal HTML entry point for the Powerpal Vite/React app, mounting the React root and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that reads the localStorage profile and conditionally renders OnboardingFlow for new users or the appropriate view (workout, meal, schedule, goals, adaptive) for returning users.",
  "frontend/src/components/AdaptiveLevelsView.tsx": "View component that lets users select a fitness level (beginner/intermediate/advanced) and applies it by saving the updated profile and regenerating the workout plan via localStorage-based hooks.",
  "frontend/src/components/GoalDrivenPlansView.tsx": "View component that lets users select a fitness goal and regenerates both workout and meal plans locally, featuring the PowerpalMascot and navigation to all other views.",
  "frontend/src/components/LoginScreen.tsx": "Login screen component shown to unauthenticated users, displaying the Powerpal branding and an Internet Identity login button.",
  "frontend/src/components/MealPlanView.tsx": "Displays a personalized weekly meal plan with day-by-day navigation, allowing users to regenerate the plan and navigate to other app sections (Workout, Schedule, Goals, Levels).",
  "frontend/src/components/OnboardingFlow.tsx": "A 3-step onboarding wizard that collects user name, age, fitness level, and goal, then saves the profile and generates initial workout and meal plans.",
  "frontend/src/components/PowerpalMascot.tsx": "Renders an animated mascot image with a rotating speech bubble displaying context-specific motivational messages for home, onboarding, plan, and meal screens.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/WeeklyScheduleView.tsx": "Shows a weekly workout schedule with expandable day details, completion tracking, and a progress counter, with options to regenerate the plan and navigate to other views.",
  "frontend/src/components/WorkoutPlanView.tsx": "Displays the user's generated workout plan with a banner, mascot, and per-day exercise details, plus a button to generate or regenerate the plan.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using the user's Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useLocalQueries.ts": "Defines React Query hooks for reading and writing profile, workout plan, and meal plan data to/from localStorage, with local plan generation utilities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks that interact with the ICP backend actor to fetch and mutate user profile, workout plan, and meal plan data.",
  "frontend/src/index.css": "Global stylesheet that imports Barlow fonts, configures Tailwind with OKLCH-based CSS custom properties for theming, and defines utility classes and keyframe animations for the athletic UI.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/HomePage.tsx": "Landing page component displaying a hero section with mascot, tagline, CTA buttons, and feature cards that route to different app sections based on whether the user has a profile.",
  "frontend/src/utils/localStorage.ts": "Utility module for persisting and retrieving profile, workout plan, and meal plan data in localStorage, with custom BigInt JSON serialization/deserialization support.",
  "frontend/src/utils/planGenerator.ts": "Generates weekly workout and meal plans based on a user's fitness goal (weight loss, muscle gain, endurance, etc.). Returns structured plan objects with exercises per day and goal-specific meal options.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining custom fonts, OKLCH-based color tokens, border radii, glow box shadows, and accordion animations, with typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the current project state for the Powerpal fitness app, recording existing features, a pending feature request to change the 'Your Workout Plan' section background to green, and architectural metadata."
}